let publicIPs = DeviceNetworkEvents 
| where RemoteIPType == "Public"
| where InitiatingProcessCommandLine has_any ("TermService","termsvcs")
| project RemoteIP;
DeviceLogonEvents 
| where RemoteIP in (publicIPs)
| summarize Failed = countif(ActionType == 'LogonFailed'),Success =  countif(ActionType == 'LogonSuccess'), totalip = dcount(RemoteIP ) by DeviceName, RemoteIP
| sort by Failed desc  