CommonSecurityLog
| where TimeGenerated >= ago(4h)
| summarize count(), Size = sum(_BilledSize) by bin(TimeGenerated, 1m)
| extend counttemp =count_ / 60
| summarize 
    ['Maximum eps']=avg(counttemp) by bin(TimeGenerated,1m)
| order by TimeGenerated asc
| render timechart 

//Syslog
//| where TimeGenerated >= ago(3d)
//| make-series count() default=0 on TimeGenerated from ago(3d) to now() step 10m
//| render timechart