let dt_lookBack = 1h; // Look back 1 hour for GCP Events
let ioc_lookBack = 14d; // Look back 14 days for threat intelligence indicators
// Fetch threat intelligence indicators related to IP addresses
let IP_Indicators = ThreatIntelligenceIndicator
  | where isnotempty(NetworkIP) or isnotempty(EmailSourceIpAddress) or isnotempty(NetworkDestinationIP) or isnotempty(NetworkSourceIP)
  | where TimeGenerated >= ago(ioc_lookBack)
  | extend TI_ipEntity = iff(isnotempty(NetworkIP), NetworkIP, NetworkDestinationIP)
  | extend TI_ipEntity = iff(isempty(TI_ipEntity) and isnotempty(NetworkSourceIP), NetworkSourceIP, TI_ipEntity)
  | extend TI_ipEntity = iff(isempty(TI_ipEntity) and isnotempty(EmailSourceIpAddress), EmailSourceIpAddress, TI_ipEntity)
  | where ipv4_is_private(TI_ipEntity) == false and  TI_ipEntity !startswith "fe80" and TI_ipEntity !startswith "::" and TI_ipEntity !startswith "127."
  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
  | where Active == true and ExpirationDateTime > now();
// Perform a join between IP indicators and GCP events
IP_Indicators
  // Use innerunique to keep performance fast and result set low, as we only need one match to indicate potential malicious activity that needs investigation
  | join kind=innerunique (
      GCPAuditLogs
      | where TimeGenerated >= ago(dt_lookBack)
      | extend SrcIpAddr = parse_json(todynamic(RequestMetadata))['callerIp']
      | extend SrcIpAddr = tostring(SrcIpAddr)
      | extend StatusInfo = parse_json(todynamic(Status))['message']
      | where StatusInfo !startswith "forbidden"
      | extend Username = tostring(split(StatusInfo, '"')[1])
      | extend GCP_TimeGenerated = TimeGenerated
  )
  on $left.TI_ipEntity == $right.SrcIpAddr
  // Filter out GCP events that occurred after the expiration of the corresponding indicator
  | where GCP_TimeGenerated < ExpirationDateTime
  // Group the results by IndicatorId and keep the GCP event with the latest timestamp
  | summarize GCP_TimeGenerated = arg_max(GCP_TimeGenerated, *) by IndicatorId, SrcIpAddr, Username